function setup() {
  createCanvas(600, 400);
  background(220);
}

function draw() {
  background(230); // 밝은 배경

  // ----------------------
  // 머리카락 (뒤쪽 전체)
  // ----------------------
  fill(90, 50, 10); // 빨간 머리색
  noStroke();
  arc(300, 160, 180, 150, PI, 0); // x 좌표를 250 에서 300 으로
  rect(210, 160, 180, 220); // x 좌표를 160 에서 210 으로
  
  // 가르마
  stroke(60, 40, 15);
  strokeWeight(2);
  line(320, 90, 300, 240); // x 좌표를 각각 270, 250 에서 320, 300 으로
  
  // ----------------------
  // 목
  // ----------------------
  noStroke();
  fill(245, 214, 179);
  rect(280, 270, 40, 40); // x 좌표를 230 에서 280 으로

  // ----------------------
  // 얼굴
  // ----------------------
  fill(255, 224, 189);
  noStroke();
  strokeWeight(1);
  ellipse(300, 210, 140, 160); // x 좌표를 250 에서 300 으로

  // 귀
  fill(255, 224, 189);
  ellipse(225, 210, 20, 35); // x 좌표를 175 에서 225 으로
  ellipse(375, 210, 20, 35); // x 좌표를 325 에서 375 으로

  // ----------------------
  // 안경
  // ----------------------
  noFill();
  stroke(0);
  strokeWeight(4);
  ellipse(270, 200, 40, 40); // x 좌표를 220 에서 270 으로
  ellipse(330, 200, 40, 40); // x 좌표를 280 에서 330 으로

  line(290, 200, 310, 200); // x 좌표를 240, 260 에서 290, 310 으로

  line(230, 193, 250, 200); // x 좌표를 180, 200 에서 230, 250 으로
  line(350, 200, 370, 193); // x 좌표를 300, 320 에서 350, 370 으로

  // ----------------------
  // 눈
  // ----------------------
  fill(255);
  stroke(0);
  strokeWeight(1.5);
  ellipse(270, 200, 25, 20); // x 좌표를 220 에서 270 으로
  ellipse(330, 200, 25, 20); // x 좌표를 280 에서 330 으로

  fill(80, 50, 20);
  ellipse(270, 200, 10, 10); // x 좌표를 220 에서 270 으로
  ellipse(330, 200, 10, 10); // x 좌표를 280 에서 330 으로

  // ----------------------
  // 귀걸이
  // ----------------------
  fill(192, 192, 192);
  noStroke();
  ellipse(225, 220, 5, 5); // x 좌표를 175 에서 225 으로
  ellipse(375, 220, 5, 5); // x 좌표를 325 에서 375 으로

  // ----------------------
  // 눈썹
  // ----------------------
  stroke(0);
  strokeWeight(3);
  noFill();
  arc(270, 175, 35, 15, PI, TWO_PI); // x 좌표를 220 에서 270 으로
  arc(330, 175, 35, 15, PI, TWO_PI); // x 좌표를 280 에서 330 으로

  // ----------------------
  // 타원 곡선 코
  // ----------------------
  strokeWeight(1.5);
  noFill();
  arc(295, 225, 20, 20, -PI/4, PI/4); // x 좌표를 245 에서 295 으로

  // ----------------------
  // 입
  // ----------------------
  noStroke();
  fill(220, 50, 90);
  arc(300, 250, 40, 20, 0, PI); // x 좌표를 250 에서 300 으로



  // ----------------------
  // 옷
  // ----------------------
  fill(255, 212, 0);
  rect(190, 310, 220, 150, 50); // x 좌표를 150 에서 200 으로
  
  noStroke();
  fill(245, 214, 179);
  arc(300, 310, 60, 40, 0, PI); // x 좌표를 250 에서 300 으로

  // 팔
  stroke(255, 180, 0);
  strokeWeight(2);
  line(240, 370, 240, 500); // x 좌표를 190 에서 240 으로
  line(360, 370, 360, 500); // x 좌표를 310 에서 360 으로
}
